       01 NEW-ITEM-DESCRIPTION PIC X(35).
       01 ACTIVE-USER PIC X(10).
       01 ITEM-PRIO PIC X VALUE "4".
       01 ITEM-TO-DELETE PIC 9(5).
       01 WHICH-KIND-SORT PIC X(10).
