       01 TODO-ACTION PIC X(20).
          88 ACTION-ADD VALUE "add".
          88 ACTION-SHOW VALUE "show".
          88 ACTION-DELETE VALUE "delete".
          88 ACTION-DELETEITEM VALUE "deleteitem".
