       01 NEW-ITEM.
          05 NEW-ITEM-DESCRIPTION PIC X(35).
          05 ACTIVE-USER PIC X(10).
          05 ITEM-PRIO PIC X VALUE "4".
       01 ITEM-TO-DELETE PIC 9(5).
       01 WHICH-KIND-SORT PIC X(10).
